import torch

a = torch.randn(4,4)
print(a)
print(a.argmax(0)) # dim=0 列最大值
print(a.argmax(1)) # dim=1 行最大值


a = torch.randn(2,2,2)
print(a)
print(a.argmax(0)) # 返回最大值的索引
print(a.argmax(1)) # 返回最大值的索引
print(a.argmax(2)) # 返回最大值的索引

# 比较第几维就是把第几维拍成一行一行的数据, 然后取每列的最大值
# 第0维: 0,4, 1,5这样进行比较
# [[[0, 1],[2,3]],
#  [[4, 5],[6,7]]]
# 第1维 0,2 1,3 这样进行比较
# [
#  [
#   [0,1],
#   [2,3]
#  ],
#  [
#   [4,5],
#   [6,7]
#  ]
# ]
# 第2维 0,1 2,3 这样进行比较
# [[
#   [
#    0, 
#    1
#   ],
#   [
#    2,
#    3
#   ]
# ],
# [
#   [
#    4, 
#    5
#   ],
#   [
#    6,
#    7
#   ]
# ]]